# Author: Inon Weber and Or Chechik
# Email : inonweber@gmail.com, orchechik@gmail.com
# Twitter: @orchechik
# Description: Volatility plugin to detect rop gadgets in Windows memory dumps

import struct
import volatility.utils as utils
import volatility.plugins.taskmods as taskmods
import volatility.plugins.vadinfo as vadinfo
import volatility.plugins.malware.malfind as malfind
import volatility.plugins.modscan as modscan
import volatility.debug as debug
import volatility.obj as obj

try:
    import distorm3
    has_distorm3 = True
except ImportError:
    has_distorm3 = False
    debug.warning("distorm3 isn't found, install distorm3 using pip")

# Constants:

PAGE_SIZE = 4096

# Critical Functions
CRITICAL_FUNCTIONS = {'ntdll.dll': ['NtSetInformationProcess', 'ZwSetInformationProcess', 'NtProtectVirtualMemory',
                                    'ZwProtectVirtualMemory', 'NtAllocateVirtualMemory', 'NtAllocateVirtualMemoryEx',
                                    'ZwAllocateVirtualMemory', 'ZwAllocateVirtualMemoryEx', 'NtCreateProcess',
                                    'NtCreateProcessEx', 'ZwCreateProcess', 'ZwCreateProcessEx', 'LdrLoadDll'],
                      'kernel32.dll': ['SetProcessInformation', 'VirtualProtect', 'VirtualProtectEx', 'VirtualAlloc',
                                       'VirtualAllocEx', 'VirtualAllocExNuma', 'CreateProcessA', 'CreateProcessW',
                                       'CreateProcessAsUserA', 'CreateProcessAsUserW', 'CreateProcessInternalA',
                                       'CreateProcessInternalW', 'LoadLibraryA', 'LoadLibraryW', 'GetProcAddressStub',
                                       'GetProcAddress', ],
                      'shell32.dll': ['ShellExecuteA', 'ShellExecuteW', 'ShellExecuteEx', 'ShellExecuteExA',
                                      'ShellExecuteExW']}

# Code Control Instructions
CODE_CONTROL_INSTRUCTIONS = ['RET', 'INT', "SYSCALL", "SYSENTER"]

# Jump instructions
JUMP_INSTRUCTIONS = ['CALL', 'JMP', 'JNZ', 'JZ', 'JL', 'JE', 'JNE', 'JB', 'JS', 'JG', 'JA', 'JNP', 'JECXZ']

# Junk instructions
JUNK_INSTRUCTIONS = ['IN', 'OUT', 'INS', 'OUTS', 'DB', 'HLT', 'CLC', 'STI', 'ADC', 'SBB', 'LOOPNZ', 'RCR', 'PSUBSW',
                     'CWDE', 'CDQ', 'STD', 'DAA', 'CMPSB', 'CLD', 'STC']

# Vtypes:

wow64_vtypes = {
  '_WOW64_CONTEXT' : [ 0x2cc, {
    'ContextFlags' : [ 0x0, ['unsigned long']],
    'Dr0' : [ 0x4, ['unsigned long']],
    'Dr1' : [ 0x8, ['unsigned long']],
    'Dr2' : [ 0xc, ['unsigned long']],
    'Dr3' : [ 0x10, ['unsigned long']],
    'Dr6' : [ 0x14, ['unsigned long']],
    'Dr7' : [ 0x18, ['unsigned long']],
    'FloatSave' : [ 0x1c, ['_FLOATING_SAVE_AREA']],
    'SegGs' : [ 0x8c, ['unsigned long']],
    'SegFs' : [ 0x90, ['unsigned long']],
    'SegEs' : [ 0x94, ['unsigned long']],
    'SegDs' : [ 0x98, ['unsigned long']],
    'Edi' : [ 0x9c, ['unsigned long']],
    'Esi' : [ 0xa0, ['unsigned long']],
    'Ebx' : [ 0xa4, ['unsigned long']],
    'Edx' : [ 0xa8, ['unsigned long']],
    'Ecx' : [ 0xac, ['unsigned long']],
    'Eax' : [ 0xb0, ['unsigned long']],
    'Ebp' : [ 0xb4, ['unsigned long']],
    'Eip' : [ 0xb8, ['unsigned long']],
    'SegCs' : [ 0xbc, ['unsigned long']],
    'EFlags' : [ 0xc0, ['unsigned long']],
    'Esp' : [ 0xc4, ['unsigned long']],
    'SegSs' : [ 0xc8, ['unsigned long']],
    'ExtendedRegisters' : [ 0xcc, ['array', 512, ['unsigned char']]]}]
    }


# Profile modification
class Wow64Context(obj.ProfileModification):
    before = ['WindowsObjectClasses', 'WindowsOverlay']
    conditions = {'os': lambda x: x == 'windows'}

    def modification(self, profile):
        profile.vtypes.update(wow64_vtypes)


# Address Symbol class
class AddressSymbol(object):
    """ A class for representing an address and its function symbol"""

    def __init__(self, address, address_lib, address_symbol, address_symbol_offset):
        """
        :param address: address object
        :param address_lib: name of address' containing vad
        :param address_symbol: symbol name
        :param address_symbol_offset: offset into symbol\vad of address
        """
        self.address = address
        self.address_lib = address_lib
        self.address_symbol = address_symbol
        self.address_symbol_offset = address_symbol_offset

    @property
    def Address(self):
        return self.address

    @property
    def LibName(self):
        if ".dll" in str(self.address_lib).lower():
            return str(self.address_lib).split('\\')[-1].split('.')[0].lower()
        return str(self.address_lib).lower()

    @property
    def Symbol(self):
        return self.address_symbol

    @property
    def SymbolOffset(self):
        return self.address_symbol_offset

    @property
    def Valid(self):
        return True if (self.address_lib or self.address_symbol or self.address_symbol_offset) else False

    def __str__(self):
        if not self.Valid:
            return "{0:#18x}".format(self.Address)
        elif not self.address_symbol:
            return "{0:#18x} {1}+{2}".format(self.Address, self.LibName, hex(self.SymbolOffset).strip('L'))
        elif not self.SymbolOffset:
            return "{0:#18x} {1}!{2}".format(self.Address, self.LibName, self.Symbol)
        else:
            return "{0:#18x} {1}!{2}+{3}".format(self.Address, self.LibName, self.Symbol,
                                                 hex(self.SymbolOffset).strip('L'))

    def __repr__(self):
        if not self.Valid:
            return "{0:#18x}".format(self.Address)
        elif not self.address_symbol:
            return "{0:#18x} {1}+{2}".format(self.Address, self.LibName, hex(self.SymbolOffset).strip('L'))
        elif not self.SymbolOffset:
            return "{0:#18x} {1}!{2}".format(self.Address, self.LibName, self.Symbol)
        else:
            return "{0:#18x} {1}!{2}+{3}".format(self.Address, self.LibName, self.Symbol,
                                                 hex(self.SymbolOffset).strip('L'))

    @staticmethod
    def get_symbols(task):
        """
        Gets all symbols in a specific task, used on every process for caching purposes.
        :param task:
        :return: dict of {pid: {address:symbol}} or empty dict if none found.
        """
        symbols_dict = {}

        for module in task.get_load_modules():
            dll_name = module.FullDllName

            # Iterate every export for each module
            for o, f, n in module.exports():
                if n and f:
                    symbols_dict[f] = AddressSymbol(f + module.DllBase, dll_name, n, 0)

        return symbols_dict

    @staticmethod
    def find_symbols(task, search_list, search_by_name=False, specified_modules=False):
        """"
        Find symbols-addresses mapping in specified task.
        :param task: the _EPROCESS object to search the symbols in
        :param search_list: a list of either addresses or symbols, depending on search_by_name parameter
        :param search_by_name: search by symbols parameter, default is False for addresses search, use True is for symbols
        :param specified_modules: specify modules to search in. If True, search_list will be module name-symbols dictionary
        :return address-AddressSymbol class dictionary or None if not found
        """
        symbols_dict = dict()

